chapter13/movingRefinedMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.005/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    REST
    {
        type            patch;
        nFaces          3920;
        startFace       72040;
    }
    ZMAX
    {
        type            patch;
        nFaces          400;
        startFace       75960;
    }
    ZMIN
    {
        type            patch;
        nFaces          400;
        startFace       76360;
    }
)

// ************************************************************************* //
